/********************************************************************** 
*  文件名称:  Hal_Uart.h
*  文件描述:  串口初始化、串口字符串发送
*  历史记录:  
*  创建时间:  2024-05-10  
*  创建人:    江昌钤
*  修改时间:
*  修改人:  
*  描述: 	  
***********************************************************************/

#ifndef _HAL_UART_H_
#define _HAL_UART_H_

/********************************************************************** 
头文件引用声明
***********************************************************************/
#include    <stdint.h>
/********************************************************************** 
宏定义
***********************************************************************/
//=====================================================================
//IO口定义
//=====================================================================
/* 串口1发送/接收           UART1_TX/RX:PA9/PA10     */
#define IOMUX_UART1         GPIO_MUX_7
#define PT_UART1_TX         GPIOA  
#define IO_UART1_TX         GPIO_PINS_9
#define NUM_UART1_TX        GPIO_PINS_SOURCE9
#define PT_UART1_RX         GPIOA
#define IO_UART1_RX         GPIO_PINS_10
#define NUM_UART1_RX        GPIO_PINS_SOURCE10

/* 串口2发送/接收           UART2_TX/RX:PA2/PA3     */
#define IOMUX_UART2         GPIO_MUX_7
#define PT_UART2_TX         GPIOA  
#define IO_UART2_TX         GPIO_PINS_2
#define NUM_UART2_TX        GPIO_PINS_SOURCE2
#define PT_UART2_RX         GPIOA
#define IO_UART2_RX         GPIO_PINS_3
#define NUM_UART2_RX        GPIO_PINS_SOURCE3

/* 串口3发送/接收           UART3_TX/RX:PC5/PC4     */
#ifndef NOUSEDEMOBOARD
	#define IOMUX_UART3         GPIO_MUX_7
	#define PT_UART3_TX         GPIOC  
	#define IO_UART3_TX         GPIO_PINS_5
	#define NUM_UART3_TX        GPIO_PINS_SOURCE5
	#define PT_UART3_RX         GPIOC
	#define IO_UART3_RX         GPIO_PINS_4
	#define NUM_UART3_RX        GPIO_PINS_SOURCE4
#endif
/* 串口4发送/接收           UART4_TX/RX:PC10/PC11     */
#define IOMUX_UART4         GPIO_MUX_8
#define PT_UART4_TX         GPIOC  
#define IO_UART4_TX         GPIO_PINS_10
#define NUM_UART4_TX        GPIO_PINS_SOURCE10
#define PT_UART4_RX         GPIOC
#define IO_UART4_RX         GPIO_PINS_11
#define NUM_UART4_RX        GPIO_PINS_SOURCE11

/* 串口5发送/接收           UART5_TX/RX:PC12/PD2     */
#define IOMUX_UART5         GPIO_MUX_8
#define PT_UART5_TX         GPIOC  
#define IO_UART5_TX         GPIO_PINS_12
#define NUM_UART5_TX        GPIO_PINS_SOURCE12
#define PT_UART5_RX         GPIOD
#define IO_UART5_RX         GPIO_PINS_2
#define NUM_UART5_RX        GPIO_PINS_SOURCE2

/* 串口7发送/接收           UART7_TX/RX:PB4/PB3     */
#define IOMUX_UART7         GPIO_MUX_8
#define PT_UART7_TX         GPIOB  
#define IO_UART7_TX         GPIO_PINS_4
#define NUM_UART7_TX        GPIO_PINS_SOURCE4
#define PT_UART7_RX         GPIOB
#define IO_UART7_RX         GPIO_PINS_3
#define NUM_UART7_RX        GPIO_PINS_SOURCE3
/********************************************************************** 
结构、枚举、公用体等结构定义
***********************************************************************/


/********************************************************************** 
源文件定义变量声明

extern 外部变量声明
***********************************************************************/

/********************************************************************** 
源文件函数声明

extern 外部函数声明
***********************************************************************/
/*----------------------------------------------------------------------------
函数名称： Hal_Uart1_Init
具体描述： 串口1初始化
----------------------------------------------------------------------------*/
void Hal_Uart1_Init(void);
/*----------------------------------------------------------------------------
函数名称： Hal_Uart1_Deinit
具体描述： 串口1失能
----------------------------------------------------------------------------*/
void Hal_Uart1_Deinit(void);
/*----------------------------------------------------------------------------
函数名称： Hal_Uart2_Init
具体描述： 串口2初始化
----------------------------------------------------------------------------*/
void Hal_Uart2_Init(void);
/*----------------------------------------------------------------------------
函数名称： Hal_Uart2_Deinit
具体描述： 串口2失能
----------------------------------------------------------------------------*/
void Hal_Uart2_Deinit(void);
/*----------------------------------------------------------------------------
函数名称： Hal_Uart3_Init
具体描述： 串口3初始化
----------------------------------------------------------------------------*/
void Hal_Uart3_Init(void);
/*----------------------------------------------------------------------------
函数名称： Hal_Uart3_Deinit
具体描述： 串口3失能
----------------------------------------------------------------------------*/
void Hal_Uart3_Deinit(void);
/*----------------------------------------------------------------------------
函数名称： Hal_Uart4_Init
具体描述： 串口4初始化
----------------------------------------------------------------------------*/
void Hal_Uart4_Init(void);
/*----------------------------------------------------------------------------
函数名称： Hal_Uart4_Deinit
具体描述： 串口4失能
----------------------------------------------------------------------------*/
void Hal_Uart4_Deinit(void);
/*----------------------------------------------------------------------------
函数名称： uart1_tx_string
具体描述： uart1发送字符串
输入参数： * p_u8arrary 字符串数据   length 字符串长度
----------------------------------------------------------------------------*/
void uart1_tx_string(uint8_t * p_u8arrary,uint16_t length);
/*----------------------------------------------------------------------------
函数名称： uart2_tx_string
具体描述： uart2发送字符串
输入参数： * p_u8arrary 字符串数据   length 字符串长度
----------------------------------------------------------------------------*/
void uart2_tx_string(uint8_t * p_u8arrary,uint16_t length);
/*----------------------------------------------------------------------------
函数名称： uart3_tx_string
具体描述： uart3发送字符串
输入参数： * p_u8arrary 字符串数据   length 字符串长度
----------------------------------------------------------------------------*/
void uart3_tx_string(uint8_t * p_u8arrary,uint16_t length);
/*----------------------------------------------------------------------------
函数名称： uart4_tx_string
具体描述： uart4发送字符串
输入参数： * p_u8arrary 字符串数据   length 字符串长度
----------------------------------------------------------------------------*/
void uart4_tx_string(uint8_t * p_u8arrary,uint16_t length);
/*----------------------------------------------------------------------------
函数名称： uart1_data_send
具体描述： uart1发送字符
输入参数： value 字符数据
----------------------------------------------------------------------------*/
void uart1_data_send(uint16_t value);
/*----------------------------------------------------------------------------
函数名称： uart2_data_send
具体描述： uart2发送字符
输入参数： value 字符数据
----------------------------------------------------------------------------*/
void uart2_data_send(uint16_t value);
/*----------------------------------------------------------------------------
函数名称： uart3_data_send
具体描述： uart3发送字符
输入参数： value 字符数据
----------------------------------------------------------------------------*/
void uart3_data_send(uint16_t value);
/*----------------------------------------------------------------------------
函数名称： uart4_data_send
具体描述： uart4发送字符
输入参数： value 字符数据
----------------------------------------------------------------------------*/
void uart4_data_send(uint16_t value);
#endif
