/********************************************************************** 
*  文件名称:  Hal_Flash.h
*  文件描述:  硬件设备初始化，对MCU的外设、硬件驱动相关初始化
*  历史记录:  
*  创建时间:  2024-05-9  
*  创建人:    江昌钤
*  修改时间:
*  修改人:  
*  描述: 	  
***********************************************************************/

#ifndef _HAL_FLASH_H_
#define _HAL_FLASH_H_

/********************************************************************** 
头文件引用声明
***********************************************************************/
#include    <stdint.h>
/********************************************************************** 
宏定义
***********************************************************************/
/* 成功 */
#ifndef SUCC
#define SUCC						0
#endif
/* 失败 */
#ifndef FAIL
#define FAIL						1
#endif
/* FLASH单页大小 */
#define PAGESIZE                    0X800
/* APP开始地址 */
#define APP_START_ADDR				((uint32_t)0x08004000)	
/* APP结束地址 */
#define APP_END_ADDR				((uint32_t)0x080F8000)
/* APP地址范围判断 */
#define ADDR_IN_FLASH(addr)			(((addr) >= APP_START_ADDR) && ((addr) < APP_END_ADDR))
/* BOOT地址 */
#define CSBOOT_BOOT_BASE    				((uint32_t)0x08000000)
/* RAM大小 */
#define CSBOOT_VECTOR_SIZE					(0xC0)
/* RAM地址 */
#define CSBOOT_VECTOR_BASE					(CSBOOT_BOOT_BASE)
#define SRAM_SIZE                        384
/********************************************************************** 
结构、枚举、公用体等结构定义
***********************************************************************/


/********************************************************************** 
源文件定义变量声明

extern 外部变量声明
***********************************************************************/

/********************************************************************** 
源文件函数声明

extern 外部函数声明
***********************************************************************/
/*----------------------------------------------------------------------------
函数名称： Hal_Flash_Init
具体描述： FLASH初始化
----------------------------------------------------------------------------*/
void Hal_Flash_Init(void);
/*----------------------------------------------------------------------------
函数名称： flash_readwords
具体描述： FLASH读一个32字节
输入参数： u32ReadAdd  读地址
----------------------------------------------------------------------------*/
uint32_t  Hal_Flash_Read_Word(uint32_t u32ReadAdd);
/*----------------------------------------------------------------------------
函数名称： Hal_Flash_Write_Word
具体描述： FLASH写一个32字节
输入参数： u32WriteAdd  写地址
           u32WriteDate 写数据
----------------------------------------------------------------------------*/
void  Hal_Flash_Write_Word(uint32_t u32WriteAdd,uint32_t u32WriteDate);
/*----------------------------------------------------------------------------
函数名称： Hal_Falsh_Erase_More_Page
具体描述： 擦除FLASH多个页
输入：     u32EraseAdd 擦除地址   
           u8PageNum 擦除页数量
输出：     SUCC  成功    FAIL  失败
----------------------------------------------------------------------------*/
uint8_t Hal_Falsh_Erase_More_Page(uint32_t u32EraseAdd,uint8_t u8PageNum);
/*----------------------------------------------------------------------------
函数名称： Hal_Flash_Write_More_Word
具体描述： 写FLASH
输入参数： u32DataAddr   写地址    
           Buf           写数据   
           u32CharSize   字节长度
----------------------------------------------------------------------------*/
uint32_t Hal_Flash_Write_More_Word(uint32_t u32DataAddr,uint8_t *Buf,uint32_t u32ByteSize);
/*----------------------------------------------------------------------------
函数名称： Hal_Flash_Read_More_Word
具体描述： 读FLASH多字节
输入参数： pBuf              保存的BUF    
           u32Addr           读地址   
           u16WordSize       字长度
----------------------------------------------------------------------------*/
uint8_t Hal_Flash_Read_More_Word(uint32_t *pBuf,uint32_t u32Addr,uint16_t u16WordSize);
/*----------------------------------------------------------------------------
函数名称： Hal_Flash_Check
具体描述： Flash比对检验
输入参数： size          校验字长   
           u32Addr       写入数据地址   
           *rxadd        收到数据
----------------------------------------------------------------------------*/
uint8_t Hal_Flash_Check(uint32_t size,uint32_t u32Addr,uint8_t *rxbuf);
/*----------------------------------------------------------------------------
函数名称： Hal_Falsh_Jump
具体描述： 跳转
----------------------------------------------------------------------------*/
void Hal_Falsh_Jump(void);
#endif
