/**********************************************************************
*  文件名称: api_fifo.h
*  文件描述: 环形缓冲队列简单实现
*  历史记录:  
*  创建时间: 2019-04-12
*  创建人:   江昌钤
*  修改时间:
*  修改人:  
*  描述: 	  
***********************************************************************/
#ifndef _API_FIFO_H_
#define _API_FIFO_H_

/********************************************************************** 
头文件引用声明
***********************************************************************/
#include <stdint.h>
/********************************************************************** 
宏定义
***********************************************************************/

#define FIFO_INVAID_ID 					((uint32_t)(-1))
#define FIFO_NODE_MIN 					(3)


/********************************************************************** 
结构、枚举、公用体等结构定义
***********************************************************************/
typedef volatile struct
{
	uint32_t u32NodeMaxNum;					/* 最大节点数 */	
	uint32_t u32NodeLen;					/* 节点单元所占字节数 */	
	uint32_t u32ReadAdd;					/* 指向第一个有效的节点地址 READ*/	
	uint32_t u32WriteAdd;					/* 指向第一个空闲的地址 WRITE*/
	uint8_t *ptNodeBufAddr;					/* FIFO缓冲池地址 */	
}FIFO_CTRL_T;

/********************************************************************** 
源文件定义变量声明

extern 外部变量声明
***********************************************************************/


/********************************************************************** 
源文件函数声明

extern 外部函数声明
***********************************************************************/


/********************************************************************** 
*  函数名称: lm_fifo_init
*  功能描述: 定义并初始化一个环形队列
*  参数说明:
*  输    入: ptFifoCtrl:环形队列的控制参数结构体；
*			 u32NodeMaxNum:环形队列节点个数；
*			 u32NodeLen:每个节点长度；
*			 pNodeArray:环形队列地址；
*  输    出: 无
*  返 回 值: FAIL: 失败;  SUCC: 成功  
***********************************************************************/
int8_t lm_fifo_init(FIFO_CTRL_T *ptFifoCtrl,uint32_t u32NodeMaxNum,
									uint32_t u32NodeLen,void *pNodeArray);

/********************************************************************** 
*  函数名称: lm_fifo_is_full
*  功能描述: 检查是否为满
*  参数说明: 
*  输    入: 
*  输    出: 
*  返 回 值: 
***********************************************************************/
int8_t lm_fifo_is_full(FIFO_CTRL_T *ptFifoCtrl);

/********************************************************************** 
*  函数名称: lm_fifo_add_node_impolite
*  功能描述: 非礼貌方式添加一个节点，即若满则删除一个头节点，并加到尾节点；
*  参数说明: 
*  输    入: 
*  输    出: 
*  返 回 值: SUCC:添加成功
***********************************************************************/
int8_t lm_fifo_add_node_impolite(FIFO_CTRL_T *ptFifoCtrl,void *pNodeData);

/********************************************************************** 
*  函数名称: lm_fifo_get_node
*  功能描述: 获取一个头节点地址；
*  参数说明: 
*  输    入: 
*  输    出: 
*  返 回 值: 为空则返回NULL,否则返回节点地址；
***********************************************************************/
void * lm_fifo_get_node(FIFO_CTRL_T *ptFifoCtrl);

/********************************************************************** 
*  函数名称: lm_fifo_delete_node
*  功能描述: 删除一个头节点；
*  参数说明: 
*  输    入: 
*  输    出: 
*  返 回 值: 
***********************************************************************/
int8_t lm_fifo_delete_node(FIFO_CTRL_T *ptFifoCtrl);
/********************************************************************** 
*  函数名称: lm_fifo_delete_node_for_ISR
*  功能描述: 删除一个头节点(用于中断调用)；
*  参数说明: 
*  输    入: 
*  输    出: 
*  返 回 值: 
***********************************************************************/
int8_t lm_fifo_delete_node_for_ISR(FIFO_CTRL_T *ptFifoCtrl);

#endif
