/********************************************************************** 
*  文件名称: Bsp_RdssParse.h
*  文件描述: 汇总头文件
*  历史记录:  
*  创建时间:  2022-05-7  
*  创建人:    江昌钤
*  修改时间:
*  修改人:  
*  描述: 	  
***********************************************************************/

#ifndef _BSP_RDSSPARSE_H_
#define _BSP_RDSSPARSE_H_

/********************************************************************** 
头文件引用声明
***********************************************************************/
#include    <stdint.h>

/********************************************************************** 
宏定义
***********************************************************************/
#define  RDSS_TYPE_BDPWI            "$BDPWI"
#define  RDSS_TYPE_BDICP            "$BDICP"
#define  RDSS_TYPE_SIZE             6
#define  RDSS_TYPE_NUM              2

/*  RDSS解析开始符 */
#define     RDSS_START              '$'
/*  RDSS解析校验符 */
#define     RDSS_CHK                '*'
/*  RDSS解析停止符 */
#define     RDSS_STOP               '\n'
/*  RDSS最大解析长度 */
#define     RDSS_MAX_BUF_LEN        150
/*  RDSS最大解析数组长度 */
#define     RDSS_PARSE_BUF_LEN      200
/********************************************************************** 
结构、枚举、公用体等结构定义
***********************************************************************/
typedef struct
{
    uint8_t     u8Pkt[RDSS_PARSE_BUF_LEN];      /* 解析缓存 */
    uint16_t    u16BufLen;                      /* 解析缓存长度 */
    uint8_t     u8Step;
}RDSS_RX_UNPACK_T;

typedef struct
{
	uint8_t	u8RDSSEName[10];
	uint8_t	u8TypeHead;
}RDSS_TYPE_T;

enum
{
    TYPE_RDSS_NULL = 0,
	TYPE_BDPWI_HEAD,
    TYPE_BDICP_HEAD,
};

typedef struct
{
	uint8_t		u8WBSer;			            // 波束编号
	uint8_t		u8WES2C_d;						// 波束S2C_d载噪比
	uint8_t		u8WES2C_p;						// 波束S2C_p载噪比
}WAVE_BEAM_INFO_T;

typedef struct
{
	double				dRDSSTime;						// 时间
	uint8_t				u16BeamNum;			            // 波束数量
	WAVE_BEAM_INFO_T	tWaveBeam[10];					// 每个波束信息
	uint8_t				u8IFSignedOK;                   // 信号是否良好
}RDSS_SIGNAL_T;
/********************************************************************** 
源文件定义变量声明

extern 外部变量声明
***********************************************************************/


/********************************************************************** 
源文件函数声明

extern 外部函数声明
***********************************************************************/
/*----------------------------------------------------------------------------
函数名称:  Bsp_GNSS_Init
功能描述:  GNSS解析初始化
----------------------------------------------------------------------------*/
void Bsp_RDSS_Init(void);
/*----------------------------------------------------------------------------
函数名称:  Bsp_Rdss_Parse_Byte
功能描述:  接收解析每个字节
输入参数:  u8Val    当前接收解析字节数据   
----------------------------------------------------------------------------*/
uint8_t Bsp_Rdss_Parse_Byte(uint8_t u8Val);
/*----------------------------------------------------------------------------
函数名称:  Bsp_Rdss_Signal_Is_Ok
功能描述:  RDSS信号是否有效
----------------------------------------------------------------------------*/
uint8_t Bsp_Rdss_Signal_Is_Ok(void);
#endif
