/********************************************************************** 
*  文件名称:  Bsp_Config.h
*  文件描述:  串口协议收发和解析、ID烧写、FLASH跳转
*  历史记录:  
*  创建时间:  2024-05-10  
*  创建人:    江昌钤
*  修改时间:
*  修改人:  
*  描述: 	  
***********************************************************************/

#ifndef _BSP_CONFIG_H_
#define _BSP_CONFIG_H_

/********************************************************************** 
头文件引用声明
***********************************************************************/
#include    <stdint.h>
/********************************************************************** 
宏定义
***********************************************************************/
//=====================================================================
//数据定义
//=====================================================================
/* 协议接收长度	*/
#define PORT_RX_LEN                 100
/* 协议发送长度	*/
#define PORT_TX_LEN                 100

/* 数据头	*/
#define PORT_HEAD_0                 0x7E
/* 数据位置	*/
#define PORT_IDX_PLD                2
/* 最大整包长度	*/
#define PORT_MAX_LEN                100
//=====================================================================
//协议定义
//=====================================================================


//OTA启动
#define PORT_CMD_OTA_START			    0X11
//版本号查询
#define PORT_CMD_VERSIONS			      0X12
//开关GNSS
#define PORT_CMD_GNSS				        0X14
//开关RDSS
#define PORT_CMD_RDSS				        0X15
//ID烧写
#define PORT_CMD_IDWRITE				    0X01
//设备信息查询
#define PORT_CMD_INFOR				      0X03
/*  ID地址 */
#define ID_ADDR                     (uint32_t)0x080FF800
/* 软件版本号	*/
#define SOFT_VER					          41                //01版本
/* 硬件版本号	*/
#define HARD_VER					          41                //船载01版本
//=====================================================================
//跳转
//=====================================================================
/*  APP_BOOT_FLAG地址 */
#define APPFLAG_ADD         (uint32_t)0x080FF000
/* BOOT FLAG */
#define FLAG_BOOT           0xAAAA5555  
/********************************************************************** 
结构、枚举、公用体等结构定义
***********************************************************************/
typedef struct
{
    uint8_t  pu8Pkt[PORT_RX_LEN];             /* 解析缓存 */
    uint8_t u8Step;
}PORT_RX_UNPACK_T;

typedef enum 
{
    INFORGET_START = 0,
    INFORGET_WAIT,
    INFORGET_FINISH,
}INFORGET_STATE_E;

typedef struct
{
    uint8_t                 u8InforGetEn;
    uint8_t                 u8CardIDGet;
    uint32_t                u32GetCardID;
    uint8_t                 u8GetPercent;
    uint16_t                u16Cont;
    uint8_t                 u8TxCont;
    INFORGET_STATE_E        eInforGetState;
}INFOR_GET_T;

enum
{
    MODE_COMMOND = 0,
    MODE_GNSS,
    MODE_RDSS,
};
/********************************************************************** 
源文件定义变量声明

extern 外部变量声明
***********************************************************************/


/********************************************************************** 
源文件函数声明

extern 外部函数声明
***********************************************************************/
/*----------------------------------------------------------------------------
函数名称： Bsp_Read_ID
具体描述： 读ID
----------------------------------------------------------------------------*/
uint32_t Bsp_Read_ID(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Port_Parse_Byte
具体描述： 按字节解析
----------------------------------------------------------------------------*/
void Bsp_Port_Parse_Byte(uint8_t u8Val);
/*----------------------------------------------------------------------------
函数名称： Bsp_Port_Init
具体描述： 协议通信初始化
----------------------------------------------------------------------------*/
void Bsp_Port_Init(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Get_CardID
具体描述： 获取北斗卡号
----------------------------------------------------------------------------*/
void Bsp_Get_CardID(uint32_t u32InCardID);
/*----------------------------------------------------------------------------
函数名称： Bsp_Port_InforGet_Ctrl
具体描述： 设备信息查询控制/100s时基
----------------------------------------------------------------------------*/
void Bsp_Port_InforGet_Ctrl(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Get_Uart_Mode
具体描述： 获取串口模式
----------------------------------------------------------------------------*/
uint8_t Bsp_Get_Uart_Mode(void);
#endif
