/********************************************************************** 
*  文件名称: hal_keyscan.h
*  文件描述: 按键动作
*  历史记录:  
*  创建时间:  2022-05-11
*  创建人:    江昌钤
*  修改时间:
*  修改人:  
*  描述: 	  
***********************************************************************/
#ifndef _HAL_KEYSCAN_
#define _HAL_KEYSCAN_
/********************************************************************** 
头文件引用声明
***********************************************************************/
#include "stdint.h"
/********************************************************************** 
宏定义
***********************************************************************/
/* 按键时间定义 */
//电源按键长按时间
#define FALL_DOWNTIME                   200
#define POWERKEY_LONGTIME               300
#define POWERKEY_SHORTTIME              100
/*   x = 459 * V  */
/********************************************************************** 
结构、枚举、公用体等结构定义
***********************************************************************/
enum
{
    STATE_NULL = 0,
    STATE_NORMAL,
    STATE_SOS,
    STATE_PULL,
    STATE_MOVE,
};
enum
{
  PRIORITY_NULL = 0,
  PRIORITY_NORMAL,
  PRIORITY_SOS,
  PRIORITY_MOVE,
  PRIORITY_PULL,
};
enum
{
    POWOFF = 0,
    POWON,
};

enum 
{
    KEY_NULL = 0,
    KEY_POWERON,
    KEY_POWON,
    KEY_SHUT,
};

typedef enum 
{
    DETECT_STARE = 0,
    DETECT_WAIT,
    DETECT_DISPLAY,
    DETECT_DISPLAY_WAIT,
    DETECT_DISPLAY_DIE,
    DETECT_SHUT,
}DETECT_STATE_E;

typedef enum 
{
    CHAG_NULL = 0,
    CHAG_START,
    CHAG_ING,
    CHAG_FULL,
}CHAG_STATE_E;

typedef struct
{
    uint16_t            u16Count;
    uint8_t             u8GetPercent;
    uint8_t             u8LedNum;
    uint8_t             u8LedNumB;
    CHAG_STATE_E        eChagState;
}VBAT_CHAG_CTRL_T;
typedef struct
{
    uint8_t             u8System_State;
    uint32_t            u32Count; 
    uint8_t             u8Priority;
    uint8_t             u8Priority_B;
}STATE_CTRL_T;
/********************************************************************** 
源文件定义变量声明

extern 外部变量声明
***********************************************************************/

/********************************************************************** 
源文件函数声明

extern 外部函数声明
***********************************************************************/
/*----------------------------------------------------------------------------
函数名称： Get_PowON_State
具体描述： 获取系统状态
----------------------------------------------------------------------------*/
uint8_t Bsp_Get_Sys_State(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Get_Pow_State
具体描述： 获取系统状态
----------------------------------------------------------------------------*/
uint8_t Bsp_Get_Pow_State(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_MagKey_Scan
具体描述： 磁感应开关扫描/10ms时基
----------------------------------------------------------------------------*/
void Bsp_MagKey_Scan(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Sys_State_Ctrl
具体描述： 状态控制/1s时基
----------------------------------------------------------------------------*/
void Bsp_Sys_State_Ctrl(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Vbat_Detect_Ctrl
具体描述： 电量检测控制/10ms时基
----------------------------------------------------------------------------*/
void Bsp_Vbat_Detect_Ctrl(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Bat_Vol_Display
具体描述： 电量显示
----------------------------------------------------------------------------*/
void Bsp_Bat_Vol_Display(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Stop_Bat_Vol_Display
具体描述： 停止电量显示
----------------------------------------------------------------------------*/
void Bsp_Stop_Bat_Vol_Display(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Error_Led_Display
具体描述： 告警灯显示
----------------------------------------------------------------------------*/
void Bsp_Error_Led_Display(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Vbat_Chag_Ctrl
具体描述： 充电显示控制/1s时基
----------------------------------------------------------------------------*/
void Bsp_Vbat_Chag_Ctrl(void);
#endif

