/********************************************************************** 
*  文件名称:  uart_send.h
*  文件描述:  短报文发送
*  历史记录:  
*  创建时间:  2023-04-28
*  创建人:    江昌钤
*  修改时间:
*  修改人:  
*  描述: 	  
***********************************************************************/
#ifndef _BSP_RDSSSEND_
#define _BSP_RDSSSEND_
/********************************************************************** 
头文件引用声明
***********************************************************************/
#include "stdint.h"
/********************************************************************** 
宏定义
***********************************************************************/
/*  正常发送频度休眠时间   */
#define 	SLEEP_TIME_NORMAL			  540

/*  SOS发送频度休眠时间   */
#define 	SLEEP_TIME_SOS			    60

/*  PULL发送频度休眠时间   */
#define 	SLEEP_TIME_PULL			    110

/*  发送消息长度  */
#define SENDBUFLEN          120
/*  发送消息字符长度  */
#define SENDCHARBUFLEN       (SENDBUFLEN*2)

#define TXBUF_LEN           2000
#define RDSS_START          '$'
#define RDSS_CHK            '*'
#define RDSS_CR             '\r'
#define RDSS_LF             '\n'
#define RDSS_TYPE_CCTCQ     "CCTCQ,"
#define RDSS_TYPE_TDGAI     "TDGAI,"
#define RDSS_TYPE_TDRFP     "TDRFP,"
#define RDSS_RECVID          "13500001,"      /* 接收方8位ID号 */
#define RDSS_FREPOINT        "2,"             /* 2：Lf1，3：Lf2  */
#define RDSS_INBAPP          "1,"             /* 1-不需确认；2-需确认 */
#define RDSS_TXTTYPE         "2,"             /* 1：汉字；2：代码；*/
#define RDSS_SENDFRE         "0"              /* 0-单次申请 */

#define RDSS_TYPE_MBA05     "MBA05,"
#define RDSS_MSG_NUM        "01,"
#define RDSS_SEND_TYPE      "B,"
#define RDSS_SEND_MODE      "A,"
#define RDSS_LOCA_NUM       "1,"
/********************************************************************** 
结构、枚举、公用体等结构定义
***********************************************************************/
typedef enum
{
  NORMAL_START = 0,
  NORMAL_GETID,
  NORMAL_OPEN_GNSS,
  NORMAL_OPEN_RDSS,
  NORMAL_ADDLOCA,
  NORMAL_SEND,
  NORMAL_WAIT,
}NORMAL_STATE_E;

typedef struct
{	
	uint32_t 	      u32Count;					  //计时	
  NORMAL_STATE_E  u8SendState;                    //发送状态
  uint32_t        u32ID;                          //ID
  uint8_t         u8PowerPercent;                 //电量
  uint8_t         u8IFGetCard;                    //是否获取到北斗卡号
  uint32_t        u32CardID;                      //北斗卡号
  uint8_t         u8CardIDNum;                    //卡号位数
  uint8_t         u8BufLen;                       //数据长度
  uint8_t         Buf_SendData[SENDBUFLEN];       //发送数据保存数组
  uint8_t         Buf_SendStr[SENDCHARBUFLEN];    //发送数据保存数组16进制格式
  double          dLongValue;                     //经度
  double          dLatValue;                      //纬度
  uint32_t        u32Time;
  uint32_t        u32Date;
  
}NORMALSEND_CTRL_T;

/********************************************************************** 
源文件定义变量声明

extern 外部变量声明
***********************************************************************/

/********************************************************************** 
源文件函数声明

extern 外部函数声明
***********************************************************************/
/*----------------------------------------------------------------------------
函数名称： Bsp_Nor_SOS_SendCtrl
具体描述： SOS发送控制/1秒时基
----------------------------------------------------------------------------*/
uint8_t Bsp_Nor_SOS_SendCtrl(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Pull_SendCtrl
具体描述： 发送控制/1秒时基
----------------------------------------------------------------------------*/
uint8_t Bsp_Pull_SendCtrl(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Start_Normal_Mode
具体描述： 开始正常发送模式
----------------------------------------------------------------------------*/
void Bsp_Start_Normal_Mode(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Start_PULL_Mode
具体描述： 开始拆除发送模式
----------------------------------------------------------------------------*/
void Bsp_Start_PULL_Mode(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Start_SOS_Mode
具体描述： 开始SOS发送模式
----------------------------------------------------------------------------*/
void Bsp_Start_SOS_Mode(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Start_PULL_Mode
具体描述： 开始拆除发送模式
----------------------------------------------------------------------------*/
void Bsp_Start_Move_Mode(void);
/*----------------------------------------------------------------------------
函数名称： Bsp_Send_Get_CardID
具体描述： 获取北斗卡号
----------------------------------------------------------------------------*/
void Bsp_Send_Get_CardID(uint32_t u32InCardID,uint8_t u8InIDNum);
/*----------------------------------------------------------------------------
函数名称： Rdss_Tx_CCICR
具体描述： RDSS发送CCICR语句
----------------------------------------------------------------------------*/
void Bsp_Rdss_Tx_CCICR(void);
#endif

